app/Controllers/CsvController.php

SELECT *
FROM `user`
WHERE `email` = 'kk@gmail.com'
 LIMIT 1
---
                    return $this->response->setJSON(['status' => 'error', 'validation_errors' => ['Invalid email format in row: ' . implode(', ', $data)]]);
                }

                if ($userModel->where('email', $data[1])->first()) {

INSERT INTO `user` (`name`, `email`, `age`) VALUES ('komal', 'kk@gmail.com', '20')
---
                    'age' => $data[2],
                ];

                if (!$userModel->insert($userData)) {